Revit 2027 API
ConcreteFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "ConcreteFinish" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConcreteFinishType
Public Enumeration ConcreteFinishType
public enum class ConcreteFinishType
type ConcreteFinishType
Members
Member name | Value | Description
Curved | 1
Custom | 4
Polished | 3
Smooth | 2
Straight | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace